In [1]:
import pandas as pd

In [16]:
data = pd.read_csv('E:/work/ML_prac/Data/sc_cust_info_txn_v1.5.csv')
print(data.head(3))

   base_ym  dpro_tgt_perd_val  cust_ctg_type cust_class sex_type age  \
0   202006           20200630          10001          C        F  28
1   202006           20200630          10001          _        _   _
2   202006           20200630          10001          E        F  24

   efct_svc_count dt_stop_yn npay_yn  r3m_avg_bill_amt  r3m_A_avg_arpu_amt  \
0               0          N       N            2640.0               792.0
1               1          N       N             300.0                90.0
2               1          N       N           16840.0              2526.0

   r3m_B_avg_arpu_amt  r6m_A_avg_arpu_amt  r6m_B_avg_arpu_amt termination_yn
0              1584.0                 0.0                 0.0              Y
1               180.0                 0.0                 0.0              Y
2              6983.0                 0.0              6981.0              N

In [17]:
data.shape

(9930, 15)

In [18]:
data.columns

Index(['base_ym', 'dpro_tgt_perd_val', 'cust_ctg_type', 'cust_class',
       'sex_type', 'age', 'efct_svc_count', 'dt_stop_yn', 'npay_yn',
       'r3m_avg_bill_amt', 'r3m_A_avg_arpu_amt', 'r3m_B_avg_arpu_amt',
       'r6m_A_avg_arpu_amt', 'r6m_B_avg_arpu_amt', 'termination_yn'],
      dtype='object')

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [19]:
data.describe()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,efct_svc_count,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt
count,9930.0,9930.0,9930.000000,9930.000000,9.930000e+03,9.930000e+03,9.930000e+03,9.930000e+03,9930.000000
mean,202006.0,20200630.0,10001.372810,1.520040,1.181774e+04,1.897536e+03,6.395259e+03,8.496206e+02,4624.897630
std,0.0,0.0,1.605016,15.404037,1.397822e+05,1.235342e+04,8.346138e+04,1.235124e+04,4561.049131
min,202006.0,20200630.0,10001.000000,0.000000,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,202006.0,20200630.0,10001.000000,1.000000,3.624503e+03,3.240000e+02,1.260000e+03,0.000000e+00,0.000000
50%,202006.0,20200630.0,10001.000000,1.000000,8.284467e+03,1.593307e+03,4.768617e+03,0.000000e+00,3959.316700
75%,202006.0,20200630.0,10001.000000,1.000000,1.372000e+04,2.308360e+03,7.982000e+03,1.006125e+03,7741.006900
max,202006.0,20200630.0,10010.000000,905.000000,1.281568e+07,1.188998e+06,7.689409e+06,1.208498e+06,64947.092000

In [22]:
data[['cust_class', 'age', 'r3m_avg_bill_amt']]

     cust_class age  r3m_avg_bill_amt
0             C  28         2640.0000
1             _   _          300.0000
2             E  24        16840.0000
3             F  32        15544.7334
4             D  18         4700.0000
...         ...  ..               ...
9925          C  15         1296.0999
9926          G  12        13799.6666
9927          C   _         1396.2000
9928          C  40         3140.0000
9929          C  59         2436.9000

[9930 rows x 3 columns]

In [14]:
data.loc[[0,3,6],['Survived','Pclass','Name']]

   Survived  Pclass                                          Name
0         0       3                       Braund, Mr. Owen Harris
3         1       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)
6         0       1                       McCarthy, Mr. Timothy J

In [15]:
data.iloc[[0,3,6],[0,2]]

   PassengerId  Pclass
0            1       3
3            4       1
6            7       1

In [36]:
extract = data[(data['sex_type']=='M') 
               & (data['r3m_avg_bill_amt']>=50000) 
               & (data['r3m_avg_bill_amt']< 100000)]
extract.head()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn
372,202006,20200630,10001,F,M,28,1,N,N,65113.66670,1310.4000,20083.5033,0.0,19426.1983,N
1049,202006,20200630,10001,D,M,20,2,N,N,80335.67685,69136.1001,3896.3334,0.0,3727.6666,N
1364,202006,20200630,10001,_,M,45,1,N,Y,54865.70000,2321.8666,8744.9382,0.0,8774.7162,N
1793,202006,20200630,10001,G,M,48,1,N,N,64804.34037,47599.4501,11313.5866,0.0,11351.4984,N
2027,202006,20200630,10001,G,M,47,1,N,Y,55368.98422,37432.2666,12903.1736,0.0,12901.1736,N

In [37]:
data['r3m_avg_bill_amt2'] = data['r3m_avg_bill_amt'] * 2
data.head()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,792.00000,1584.0000,0.0,0.0,Y,5280.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,90.00000,180.0000,0.0,0.0,Y,600.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,2526.00000,6983.0000,0.0,6981.0,N,33680.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,2331.71001,6750.4666,0.0,6508.8,N,31089.4668
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,0.00000,4502.0000,0.0,4507.7,N,9400.0000

In [39]:
data[['r3m_avg_bill_amt2','r3m_avg_bill_amt']]

      r3m_avg_bill_amt2  r3m_avg_bill_amt
0             5280.0000         2640.0000
1              600.0000          300.0000
2            33680.0000        16840.0000
3            31089.4668        15544.7334
4             9400.0000         4700.0000
...                 ...               ...
9925          2592.1998         1296.0999
9926         27599.3332        13799.6666
9927          2792.4000         1396.2000
9928          6280.0000         3140.0000
9929          4873.8000         2436.9000

[9930 rows x 2 columns]

In [40]:
data['r3m_avg_bill_amt3'] = data['r3m_avg_bill_amt2'] + data['r3m_avg_bill_amt']
data.head()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,792.00000,1584.0000,0.0,0.0,Y,5280.0000,7920.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,90.00000,180.0000,0.0,0.0,Y,600.0000,900.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,2526.00000,6983.0000,0.0,6981.0,N,33680.0000,50520.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,2331.71001,6750.4666,0.0,6508.8,N,31089.4668,46634.2002
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,0.00000,4502.0000,0.0,4507.7,N,9400.0000,14100.0000

In [41]:
data.insert(10,'r3m_avg_bill_amt10', data['r3m_avg_bill_amt'] * 10)
data.head()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_avg_bill_amt10,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,26400.000,792.00000,1584.0000,0.0,0.0,Y,5280.0000,7920.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,3000.000,90.00000,180.0000,0.0,0.0,Y,600.0000,900.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,168400.000,2526.00000,6983.0000,0.0,6981.0,N,33680.0000,50520.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,155447.334,2331.71001,6750.4666,0.0,6508.8,N,31089.4668,46634.2002
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,47000.000,0.00000,4502.0000,0.0,4507.7,N,9400.0000,14100.0000

In [42]:
data.drop('r3m_avg_bill_amt10', axis = 1)

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,792.000000,1584.0000,0.0,0.0000,Y,5280.0000,7920.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,90.000000,180.0000,0.0,0.0000,Y,600.0000,900.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,2526.000000,6983.0000,0.0,6981.0000,N,33680.0000,50520.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,2331.710010,6750.4666,0.0,6508.8000,N,31089.4668,46634.2002
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,0.000000,4502.0000,0.0,4507.7000,N,9400.0000,14100.0000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9925,202006,20200630,10001,C,F,15,1,N,Y,1296.0999,194.414985,643.1001,0.0,852.5499,N,2592.1998,3888.2997
9926,202006,20200630,10001,G,M,12,1,N,N,13799.6666,2069.949990,10605.9266,0.0,10603.9266,N,27599.3332,41398.9998
9927,202006,20200630,10005,C,_,_,1,N,N,1396.2000,1206.000000,0.0000,1212.0,0.0000,N,2792.4000,4188.6000
9928,202006,20200630,10001,C,F,40,0,N,N,3140.0000,942.000000,1884.0000,0.0,0.0000,Y,6280.0000,9420.0000
9929,202006,20200630,10001,C,F,59,1,N,N,2436.9000,365.535000,1839.9000,0.0,1919.7999,N,4873.8000,7310.7000

In [43]:
data.head()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_avg_bill_amt10,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,26400.000,792.00000,1584.0000,0.0,0.0,Y,5280.0000,7920.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,3000.000,90.00000,180.0000,0.0,0.0,Y,600.0000,900.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,168400.000,2526.00000,6983.0000,0.0,6981.0,N,33680.0000,50520.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,155447.334,2331.71001,6750.4666,0.0,6508.8,N,31089.4668,46634.2002
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,47000.000,0.00000,4502.0000,0.0,4507.7,N,9400.0000,14100.0000

In [44]:
data1 = data.drop('r3m_avg_bill_amt10', axis = 1)

In [45]:
data1.head()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,792.00000,1584.0000,0.0,0.0,Y,5280.0000,7920.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,90.00000,180.0000,0.0,0.0,Y,600.0000,900.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,2526.00000,6983.0000,0.0,6981.0,N,33680.0000,50520.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,2331.71001,6750.4666,0.0,6508.8,N,31089.4668,46634.2002
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,0.00000,4502.0000,0.0,4507.7,N,9400.0000,14100.0000

In [46]:
data.sort_index(ascending=False)

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_avg_bill_amt10,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
9929,202006,20200630,10001,C,F,59,1,N,N,2436.9000,24369.000,365.535000,1839.9000,0.0,1919.7999,N,4873.8000,7310.7000
9928,202006,20200630,10001,C,F,40,0,N,N,3140.0000,31400.000,942.000000,1884.0000,0.0,0.0000,Y,6280.0000,9420.0000
9927,202006,20200630,10005,C,_,_,1,N,N,1396.2000,13962.000,1206.000000,0.0000,1212.0,0.0000,N,2792.4000,4188.6000
9926,202006,20200630,10001,G,M,12,1,N,N,13799.6666,137996.666,2069.949990,10605.9266,0.0,10603.9266,N,27599.3332,41398.9998
9925,202006,20200630,10001,C,F,15,1,N,Y,1296.0999,12960.999,194.414985,643.1001,0.0,852.5499,N,2592.1998,3888.2997
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,47000.000,0.000000,4502.0000,0.0,4507.7000,N,9400.0000,14100.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,155447.334,2331.710010,6750.4666,0.0,6508.8000,N,31089.4668,46634.2002
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,168400.000,2526.000000,6983.0000,0.0,6981.0000,N,33680.0000,50520.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,3000.000,90.000000,180.0000,0.0,0.0000,Y,600.0000,900.0000
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,26400.000,792.000000,1584.0000,0.0,0.0000,Y,5280.0000,7920.0000

In [47]:
data.sort_index(ascending=True)

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_avg_bill_amt10,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,26400.000,792.000000,1584.0000,0.0,0.0000,Y,5280.0000,7920.0000
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,3000.000,90.000000,180.0000,0.0,0.0000,Y,600.0000,900.0000
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,168400.000,2526.000000,6983.0000,0.0,6981.0000,N,33680.0000,50520.0000
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,155447.334,2331.710010,6750.4666,0.0,6508.8000,N,31089.4668,46634.2002
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,47000.000,0.000000,4502.0000,0.0,4507.7000,N,9400.0000,14100.0000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9925,202006,20200630,10001,C,F,15,1,N,Y,1296.0999,12960.999,194.414985,643.1001,0.0,852.5499,N,2592.1998,3888.2997
9926,202006,20200630,10001,G,M,12,1,N,N,13799.6666,137996.666,2069.949990,10605.9266,0.0,10603.9266,N,27599.3332,41398.9998
9927,202006,20200630,10005,C,_,_,1,N,N,1396.2000,13962.000,1206.000000,0.0000,1212.0,0.0000,N,2792.4000,4188.6000
9928,202006,20200630,10001,C,F,40,0,N,N,3140.0000,31400.000,942.000000,1884.0000,0.0,0.0000,Y,6280.0000,9420.0000
9929,202006,20200630,10001,C,F,59,1,N,N,2436.9000,24369.000,365.535000,1839.9000,0.0,1919.7999,N,4873.8000,7310.7000

In [48]:
data.sort_values('age',ascending=False)

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_avg_bill_amt10,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn,r3m_avg_bill_amt2,r3m_avg_bill_amt3
4453,202006,20200630,10010,_,_,_,1,N,N,1510.40010,15104.0010,1331.4000,0.00000,1351.4499,0.0000,N,3020.80020,4531.20030
658,202006,20200630,10001,_,_,_,1,N,N,1263.90000,12639.0000,1149.0000,0.00000,0.0000,0.0000,Y,2527.80000,3791.70000
5016,202006,20200630,10001,_,_,_,1,N,N,17192.63326,171926.3326,0.0000,15629.66660,0.0000,12690.1000,N,34385.26652,51577.89978
8123,202006,20200630,10010,_,_,_,1,N,N,7850.66660,78506.6660,332.0001,4710.39996,338.1999,0.0000,N,15701.33320,23551.99980
9679,202006,20200630,10001,_,_,_,1,N,Y,300.00000,3000.0000,90.0000,180.00000,0.0000,0.0000,Y,600.00000,900.00000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5567,202006,20200630,10001,D,M,10,1,N,N,3380.20000,33802.0000,507.0300,2701.96700,0.0000,6455.5156,N,6760.40000,10140.60000
7903,202006,20200630,10001,D,M,10,1,N,N,9309.80000,93098.0000,1396.4700,3601.93380,0.0000,3599.9338,N,18619.60000,27929.40000
1917,202006,20200630,10001,D,M,10,1,N,N,5491.49755,54914.9755,1390.2705,3602.00000,0.0000,3600.0000,N,10982.99510,16474.49265
1898,202006,20200630,10001,D,F,10,1,N,N,9415.56000,94155.6000,2031.0000,6528.60000,0.0000,7340.6000,N,18831.12000,28246.68000
5130,202006,20200630,10001,D,F,10,1,N,N,3800.00000,38000.0000,0.0000,3602.00000,0.0000,3600.0000,N,7600.00000,11400.00000

# 3.그룹화

In [50]:
cust = pd.read_csv('E:/work/ML_prac/Data/sc_cust_info_txn_v1.5.csv')
cust

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,sex_type,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn
0,202006,20200630,10001,C,F,28,0,N,N,2640.0000,792.000000,1584.0000,0.0,0.0000,Y
1,202006,20200630,10001,_,_,_,1,N,N,300.0000,90.000000,180.0000,0.0,0.0000,Y
2,202006,20200630,10001,E,F,24,1,N,N,16840.0000,2526.000000,6983.0000,0.0,6981.0000,N
3,202006,20200630,10001,F,F,32,1,N,N,15544.7334,2331.710010,6750.4666,0.0,6508.8000,N
4,202006,20200630,10001,D,M,18,1,N,N,4700.0000,0.000000,4502.0000,0.0,4507.7000,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9925,202006,20200630,10001,C,F,15,1,N,Y,1296.0999,194.414985,643.1001,0.0,852.5499,N
9926,202006,20200630,10001,G,M,12,1,N,N,13799.6666,2069.949990,10605.9266,0.0,10603.9266,N
9927,202006,20200630,10005,C,_,_,1,N,N,1396.2000,1206.000000,0.0000,1212.0,0.0000,N
9928,202006,20200630,10001,C,F,40,0,N,N,3140.0000,942.000000,1884.0000,0.0,0.0000,Y
9929,202006,20200630,10001,C,F,59,1,N,N,2436.9000,365.535000,1839.9000,0.0,1919.7999,N

### 단일 기준 그룹

In [51]:
gender_group = cust.groupby('sex_type')
gender_group

In [52]:
gender_group.count()

,base_ym,dpro_tgt_perd_val,cust_ctg_type,cust_class,age,efct_svc_count,dt_stop_yn,npay_yn,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt,termination_yn
sex_type,,,,,,,,,,,,,,
F,4251,4251,4251,4251,4251,4251,4251,4251,4251,4251,4251,4251,4251,4251
M,4998,4998,4998,4998,4998,4998,4998,4998,4998,4998,4998,4998,4998,4998
_,681,681,681,681,681,681,681,681,681,681,681,681,681,681

In [53]:
gender_group.mean(numeric_only=True)

,base_ym,dpro_tgt_perd_val,cust_ctg_type,efct_svc_count,r3m_avg_bill_amt,r3m_A_avg_arpu_amt,r3m_B_avg_arpu_amt,r6m_A_avg_arpu_amt,r6m_B_avg_arpu_amt
sex_type,,,,,,,,,
F,202006.0,20200630.0,10001.001882,1.098800,9580.926307,1570.372299,5283.876950,452.780488,4961.455810
M,202006.0,20200630.0,10001.004802,1.204882,9839.707339,1778.988878,5342.748791,641.426866,4851.027884
_,202006.0,20200630.0,10006.389134,6.462555,40297.790077,4809.827390,21057.412985,4854.788244,864.386867

In [55]:
gender_group.mean(numeric_only=True)[['r3m_avg_bill_amt','cust_ctg_type']]

          r3m_avg_bill_amt  cust_ctg_type
sex_type
F              9580.926307   10001.001882
M              9839.707339   10001.004802
_             40297.790077   10006.389134

In [56]:
gender_group.max(numeric_only=True)[['r3m_avg_bill_amt','cust_ctg_type']]

          r3m_avg_bill_amt  cust_ctg_type
sex_type
F             7.979563e+04          10005
M             1.447397e+05          10005
_             1.281568e+07          10010

### 복수 기준 그룹

In [57]:
multi_group = cust.groupby(['cust_class', 'sex_type'])

In [58]:
multi_group.mean(numeric_only=True)[['r3m_avg_bill_amt']]

                     r3m_avg_bill_amt
cust_class sex_type
C          F              3804.342244
           M              3155.385796
           _              4719.075980
D          F              7848.842709
           M              7774.098954
           _              8419.764574
E          F             11257.301485
           M             11158.736812
           _             12208.980550
F          F             14913.105272
           M             15013.379957
           _             16231.437767
G          F             16538.595017
           M             16847.160637
           _             20180.014811
H          F             20154.938768
           M             21052.154088
_          F              4304.582332
           M              4728.388010
           _             65268.733884

In [59]:
multi_group.max(numeric_only=True)[['r3m_avg_bill_amt']]

                     r3m_avg_bill_amt
cust_class sex_type
C          F             6.815017e+04
           M             2.306917e+04
           _             2.293453e+04
D          F             5.407650e+04
           M             1.447397e+05
           _             3.232967e+04
E          F             5.226307e+04
           M             1.055625e+05
           _             1.644177e+04
F          F             5.993527e+04
           M             7.300037e+04
           _             2.956300e+04
G          F             7.979563e+04
           M             1.129005e+05
           _             3.589550e+04
H          F             7.471997e+04
           M             9.613610e+04
_          F             3.024210e+04
           M             1.320952e+05
           _             1.281568e+07

# 4.병합

### concat

In [60]:
df1 = pd.DataFrame({'key1' : [0,1,2,3,4], 'value1' : ['a', 'b', 'c','d','e']}, index=[0,1,2,3,4])
df2 = pd.DataFrame({'key1' : [3,4,5,6,7], 'value1' : ['c','d','e','f','g']}, index=[3,4,5,6,7])

In [61]:
df1

   key1 value1
0     0      a
1     1      b
2     2      c
3     3      d
4     4      e

In [62]:
df2

   key1 value1
3     3      c
4     4      d
5     5      e
6     6      f
7     7      g

In [63]:
pd.concat([df1,df2])

   key1 value1
0     0      a
1     1      b
2     2      c
3     3      d
4     4      e
3     3      c
4     4      d
5     5      e
6     6      f
7     7      g

In [64]:
pd.concat([df1,df2],axis=1)

   key1 value1  key1 value1
0   0.0      a   NaN    NaN
1   1.0      b   NaN    NaN
2   2.0      c   NaN    NaN
3   3.0      d   3.0      c
4   4.0      e   4.0      d
5   NaN    NaN   5.0      e
6   NaN    NaN   6.0      f
7   NaN    NaN   7.0      g

In [65]:
df_concat = pd.concat([df1,df2])
df_concat

   key1 value1
0     0      a
1     1      b
2     2      c
3     3      d
4     4      e
3     3      c
4     4      d
5     5      e
6     6      f
7     7      g

In [66]:
df_concat.reset_index()

   index  key1 value1
0      0     0      a
1      1     1      b
2      2     2      c
3      3     3      d
4      4     4      e
5      3     3      c
6      4     4      d
7      5     5      e
8      6     6      f
9      7     7      g

In [67]:
df_concat.reset_index(drop=True)

   key1 value1
0     0      a
1     1      b
2     2      c
3     3      d
4     4      e
5     3      c
6     4      d
7     5      e
8     6      f
9     7      g